# include<iostream>
# include<math.h>
#include <conio.h>
using namespace std;


/*Визначити добуток невід’ємних і додаток додатних значень функції y = exp(x / 3),
якщо x змінюється від xn до xk з кроком dx.*/
void main()
{
	double x, y, sum, k, xn, xk, dx;
	cout << "\n xn =";	//виведення підказки з нового рядка
	cin >> xn;		//введення початкового значення x
	cout << "\n xk = ";	//виведення підказки з нового рядка
	cin >> xk;		//введення кінцевого значення x
	cout << "\n dx = ";
	cin >> dx;		//введення кроку зміни x
	x = xn;			//присвоювання x початкового значення
	k = 1.0;			//ініціалізація добутку k
	sum = 0;			// ініціалізація суми s
	while (x <= xk)	//оператор циклу
	{
		y = exp(x / 3);	//обчислення значення функції
		cout << "\n y = " << y;	//введення поточного значення функції y
		if (y >= 0) {
			k *= y; //накопичення добутку
			if (y > 0) {
				sum += y;//накопичення суми
			}
		}
		x += dx;			//зміна аргументу x на величину кроку
	}
	cout << "\n sum = " << sum;		//виведення суми
	cout << "\n k = " << k;	//виведення кількості
	cout << endl;
	cout << "Press any key";
	_getch();//организация задержки после вывода результатов

}
